riversnails/ble_mesh-thingy52/nrf5_SDK_for_Mesh_v3.2.0_src/examples/thingy52-mesh-provisioning-demo-master/thingy_provisioning_demo/src/main.c
const custom_client_callbacks_t custom_client_cbs =
{
    .onoff_status_cb = app_custom_client_status_cb,
    .ack_transaction_status_cb = app_custom_client_transaction_status_cb,
    .periodic_publish_cb = app_custom_client_publish_interval_cb
};

ble_tes_temperature_t t_conv_data = 
{
  .integer = -1,
  .decimal = -1
};
ble_tes_humidity_t h_conv_data = -1;
ble_tes_pressure_t p_conv_data = 
{
  .integer = -1,
  .decimal = -1
};


static app_onoff_state_t save_data;
static void mesh_send_manager(custom_set_params_t send_data);

static void send_inst_requset(inst_packet_list_t inst, uint8_t *addr)
{
    custom_set_params_t set_params;
    set_params.temp_intager = -50;
    set_params.temp_decimal = 0;
    set_params.humi = 100 + inst;
    set_params.ttl = 10;
    set_params.tid = (uint8_t)get_millis();
    strcpy(set_params.addr, addr);
    //set_params.addr = addr;
    mesh_send_manager(set_params);
}

/* Callback for updating the hardware state */
static void app_custom_server_set_cb(const app_onoff_server_t * p_server, app_onoff_state_t *send_data)
{
    /* Resolve the server instance here if required, this example uses only 1 instance. */
    
    save_data.temp_intager = send_data->temp_intager;
    save_data.temp_decimal = send_data->temp_decimal;
    save_data.humi = send_data->humi;

    
    #if IS_CLIENT

     __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "t_data = %2d.%-2d h_data = %2d ttl = %d\n", 
                                        send_data->temp_intager, send_data->temp_decimal, send_data->humi, send_data->ttl);

      custom_set_params_t set_parm = 
      {
        .temp_intager = send_data->temp_intager,
        .temp_decimal = send_data->temp_decimal,
        .humi = send_data->humi,
        .ttl = send_data->ttl,
        .tid = send_data->tid,
        //.addr = send_data->addr
      };

      strcpy(set_parm.addr, send_data->addr);

      mesh_send_manager(set_parm);
    #else

     //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "get_data! t_data = %2d.%-2d h_data = %2d ttl = %d\n", 
     //                                   send_data->temp_intager, send_data->temp_decimal, send_data->humi, send_data->ttl);

    #endif
    
}

/* Callback for reading the hardware state */
static void app_custom_server_get_cb(const app_onoff_server_t * p_server, app_onoff_state_t * send_data)
{
    /* Resolve the server instance here if required, this example uses only 1 instance. */
    
    send_data->temp_intager = save_data.temp_intager;
    send_data->temp_decimal = save_data.temp_decimal;
    send_data->humi = save_data.humi;
    send_data->ttl = save_data.ttl;

    //*p_present_onoff = hal_led_pin_get();
}

static void app_model_init(void)
{
    /* Instantiate onoff server on element index APP_ONOFF_ELEMENT_INDEX */
    ERROR_CHECK(app_onoff_init(&m_onoff_server_0, APP_ONOFF_ELEMENT_INDEX+1));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App OnOff Model Handle: %d\n", m_onoff_server_0.server.model_handle);
}

/* This callback is called periodically if model is configured for periodic publishing */
static void app_custom_client_publish_interval_cb(access_model_handle_t handle, void * p_self)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_WARN, "Publish desired message here.\n");
}

/* Acknowledged transaction status callback, if acknowledged transfer fails, application can
* determine suitable course of action (e.g. re-initiate previous transaction) by using this
* callback.
*/
static void app_custom_client_transaction_status_cb(access_model_handle_t model_handle,
                                                       void * p_args,
                                                       access_reliable_status_t status)
{
    switch(status)
    {
        case ACCESS_RELIABLE_TRANSFER_SUCCESS:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Acknowledged transfer success.\n");
            break;

        case ACCESS_RELIABLE_TRANSFER_TIMEOUT:
            
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Acknowledged transfer timeout.\n");
            break;

        case ACCESS_RELIABLE_TRANSFER_CANCELLED:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Acknowledged transfer cancelled.\n");
            break;

        default:
            ERROR_CHECK(NRF_ERROR_INTERNAL);
            break;
    }
}

/* Generic OnOff client model interface: Process the received status message in this callback */
static void app_custom_client_status_cb(const custom_client_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const custom_status_params_t * p_in)
{
    //if (p_in->remaining_time_ms > 0)
    //{
    //    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "OnOff server: 0x%04x, Present OnOff: %d, Target OnOff: %d, Remaining Time: %d ms\n",
    //          p_meta->src.value, p_in->present_on_off, p_in->target_on_off, p_in->remaining_time_ms);
    //}
    //else
    //{
    //    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "OnOff server: 0x%04x, Present OnOff: %d\n",
    //          p_meta->src.value, p_in->present_on_off);
    //}
}
/*************************************************************************************************/


static void node_reset(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Node reset  -----\n");
    hal_led_blink_ms(LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_RESET);
    /* This function may return if there are ongoing flash operations. */
    mesh_stack_device_reset();
}

static void config_server_evt_cb(const config_server_evt_t * p_evt)
{
    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET)
    {
        node_reset();
    }
}

bool toggle = true;
bool test_toggle = false;

static void button_event_handler(uint32_t button_number)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Button %d pressed\n", button_number);

    custom_set_params_t set_params;

    switch (button_number)
    {
        /* Pressing SW1 on the Development Kit will result in LED state to toggle and trigger
        the STATUS message to inform client about the state change. This is a demonstration of
        state change publication due to local event. */
        case 0:
        case 1:
        {
            #if IS_CLIENT
            set_params.temp_intager = t_conv_data.integer;
            set_params.temp_decimal = t_conv_data.decimal;
            set_params.humi = h_conv_data;
            set_params.ttl = 10;
            set_params.tid = (uint8_t)get_millis();
            strcpy(set_params.addr, get_this_addr());
            //set_params.addr = get_this_addr();
            mesh_send_manager(set_params); 
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "a = %d %d\n",get_available(0), get_available(1));
            //print_all();

            #else
            
            if(toggle)
            {
                send_inst_requset(SEND_ADDR, get_this_addr());
                toggle = false;
                test_toggle = true;
            }
            else
            {
                get_data_all();

