riversnails/ble_mesh-thingy52/nrf5_SDK_for_Mesh_v3.2.0_src/examples/thingy52-mesh-provisioning-demo-master/thingy_provisioning_demo/src/main.c
            }

            #endif
        }
        default:
            break;
    }
}

void mesh_send_manager(custom_set_params_t send_data) // ----------------------------------
{
    uint32_t status = NRF_SUCCESS;
    
    
    uint32_t err = custom_client_set_unack(&c_client, &send_data, 3);

    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "send = %d\n",err);
}

static void app_rtt_input_handler(int key)
{
    if (key >= '0' && key <= '4')
    {
        uint32_t button_number = key - '0';
        button_event_handler(button_number);
    }
}

static void device_identification_start_cb(uint8_t attention_duration_s)
{
    hal_led_pin_set(false);
    hal_led_blink_ms(LED_BLINK_ATTENTION_INTERVAL_MS,
                     LED_BLINK_ATTENTION_COUNT(3));

}

static void provisioning_aborted_cb(void)
{
    hal_led_blink_stop();
}

static void provisioning_complete_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Successfully provisioned\n");

#if MESH_FEATURE_GATT_ENABLED
    /* Restores the application parameters after switching from the Provisioning
     * service to the Proxy  */
    gap_params_init();
    conn_params_init();
#endif

    dsm_local_unicast_address_t node_address;
    dsm_local_unicast_addresses_get(&node_address);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Node Address: 0x%04x \n", node_address.address_start);
    hal_led_blink_stop();
    hal_led_pin_set(0);
    hal_led_blink_ms(LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_PROV);
}

static void models_init_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Initializing and adding models\n");
    app_model_init();

    m_client.settings.p_callbacks = &custom_client_cbs;
    m_client.settings.timeout = 0;
    m_client.settings.force_segmented = APP_CONFIG_FORCE_SEGMENTATION;
    m_client.settings.transmic_size = APP_CONFIG_MIC_SIZE;

    c_client.settings.p_callbacks = &custom_client_cbs;
    c_client.settings.timeout = 0;
    c_client.settings.force_segmented = APP_CONFIG_FORCE_SEGMENTATION;
    c_client.settings.transmic_size = APP_CONFIG_MIC_SIZE;

    //ERROR_CHECK(generic_onoff_client_init(&m_client,  APP_ONOFF_ELEMENT_INDEX+1));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "%d\n", custom_client_init(&c_client,  APP_ONOFF_ELEMENT_INDEX+1));
    //ERROR_CHECK(custom_client_init(&c_client,  APP_ONOFF_ELEMENT_INDEX+2));
}
static void board_init(void)
{
    uint32_t            err_code;
    drv_ext_gpio_init_t ext_gpio_init;


    static const nrf_drv_twi_config_t twi_config =
    {
        .scl                = TWI_SCL,
        .sda                = TWI_SDA,
        .frequency          = NRF_TWI_FREQ_400K,
        .interrupt_priority = APP_IRQ_PRIORITY_LOW
    };

    static const drv_sx1509_cfg_t sx1509_cfg =
    {
        .twi_addr       = SX1509_ADDR,
        .p_twi_instance = &m_twi_sensors,
        .p_twi_cfg      = &twi_config
    };

    ext_gpio_init.p_cfg = &sx1509_cfg;
    
    err_code = support_func_configure_io_startup(&ext_gpio_init);
    APP_ERROR_CHECK(err_code);
}

/**************************************************************************
/* Handle GPIO interrupt, either button press or USB cable connected
/**************************************************************************/

void GPIOTE_IRQHandler(void)
{
    NRF_GPIOTE->EVENTS_PORT = 0;
   
        /* Check that the event was generated by a button press, and reject if it's too soon (debounce).
         * NOTE: There is a bug with this at the wrap-around for the RTC0 where the button could be
         * pressed before HAL_BUTTON_PRESS_FREQUENCY has passed a single time. It doesn't matter practically.
         */

  //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "event\n");
  if (USB_connected!=nrf_gpio_pin_read(USBCHARGE_PIN))
   {
       USB_connected = nrf_gpio_pin_read(USBCHARGE_PIN);
       if (USB_connected)
       {
        //  hal_led_blink_ms(50,2);
          NRF_GPIO->PIN_CNF[USBCHARGE_PIN] = USBCHARGE_PIN_CONFIG_LOW;
          if (!hal_led_pin_get()) 
          {
              led_breath_yellow();
          }
          else
          {
              charging_indicate_start();
           }
       }
       else
       {
       //    hal_led_blink_ms(50,2);
          NRF_GPIO->PIN_CNF[USBCHARGE_PIN] = USBCHARGE_PIN_CONFIG_HIGH;
          charging_indicate_stop();
          //if LED is off, maybe we are breathing yellow, stop breathing
          if(!hal_led_pin_get())hal_led_pin_set(0);
       }

    }
    else
    {
          
       if( TIMER_DIFF(m_last_button_press, NRF_RTC0->COUNTER) > HAL_BUTTON_PRESS_FREQUENCY)
        {
          //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Buttonpressed\n");
            m_last_button_press = NRF_RTC0->COUNTER;
            button_event_handler(0);
        }
        if(USB_connected)charging_indicate_start();
      }

    
}

uint32_t m_my_ui_init( void)
{
    uint32_t                        err_code;
    static drv_sx1509_cfg_t         sx1509_cfg;
    drv_ext_light_init_t            led_init;
    //lint --e{651} Potentially confusing initializer
    static const drv_ext_light_conf_t led_conf[DRV_EXT_LIGHT_NUM] = DRV_EXT_LIGHT_CFG;

    static const nrf_drv_twi_config_t twi_config =
    {
        .scl                = TWI_SCL,
        .sda                = TWI_SDA,
        .frequency          = NRF_TWI_FREQ_100K,
        .interrupt_priority = APP_IRQ_PRIORITY_LOW
    };
    sx1509_cfg.twi_addr       = SX1509_ADDR;
    sx1509_cfg.p_twi_instance = &m_twi_sensors;
    sx1509_cfg.p_twi_cfg      = &twi_config;



    led_init.p_light_conf        = led_conf;
    led_init.num_lights          = DRV_EXT_LIGHT_NUM;
    led_init.clkx_div            = DRV_EXT_LIGHT_CLKX_DIV_8;
    led_init.p_twi_conf          = &sx1509_cfg;
    led_init.resync_pin          = SX_RESET;

    err_code = drv_ext_light_init(&led_init, false);
    APP_ERROR_CHECK(err_code);
    ERROR_CHECK(drv_ext_light_off(DRV_EXT_RGB_LED_SENSE));
    ERROR_CHECK(drv_ext_light_off(DRV_EXT_RGB_LED_LIGHTWELL));
    nrf_gpio_cfg_output(MOS_1);
    nrf_gpio_cfg_output(MOS_2);
    nrf_gpio_cfg_output(MOS_3);
    nrf_gpio_cfg_output(MOS_4);
    nrf_gpio_pin_clear(MOS_1);
    nrf_gpio_pin_clear(MOS_2);
    nrf_gpio_pin_clear(MOS_3);
    nrf_gpio_pin_clear(MOS_4);
    //Button and charge detect pin. 
   NRF_GPIO->PIN_CNF[THINGY_BUTTON] = BUTTON_PIN_CONFIG;
    NRF_GPIO->PIN_CNF[USBCHARGE_PIN] = USBCHARGE_PIN_CONFIG_HIGH;
  
    NRF_GPIOTE->INTENSET = GPIOTE_INTENSET_PORT_Msk;
    NRF_GPIOTE->EVENTS_PORT  = 0;

    NVIC_SetPriority(GPIOTE_IRQn, GPIOTE_IRQ_LEVEL);
    NVIC_EnableIRQ(GPIOTE_IRQn);

    USB_connected= nrf_gpio_pin_read(USBCHARGE_PIN);
   // if (USB_connected) led_breath_yellow();
    return NRF_SUCCESS;
}
static void provisioning_blink_output_cb(uint8_t * number)

{   uint32_t err_code;
    ERROR_CHECK(drv_ext_light_off(1));
     __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Blink OOB %u\n", number[15]);
     //The OOB data only use last byte to set the number of blink
     //Start the blinking timer
    hal_led_blink_stop();
    hal_led_pin_set(0);
    nrf_delay_ms(300);
    hal_led_blink_ms(500,number[15]);
    APP_ERROR_CHECK(err_code);
}
static void mesh_init(void)
{
    mesh_stack_init_params_t init_params =
    {
        .core.irq_priority       = NRF_MESH_IRQ_PRIORITY_LOWEST,
        .core.lfclksrc           = DEV_BOARD_LF_CLK_CFG,
        .core.p_uuid             = NULL,
        .models.models_init_cb   = models_init_cb,
        .models.config_server_cb = config_server_evt_cb
    };
    ERROR_CHECK(mesh_stack_init(&init_params, &m_device_provisioned));
}

static void initialize(void)
{
    __LOG_INIT(LOG_SRC_APP | LOG_SRC_FRIEND, LOG_LEVEL_DBG1, LOG_CALLBACK_DEFAULT);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Thingy Provisioning Demo -----\n");
   
    ERROR_CHECK(app_timer_init());
    hal_leds_init();
    ble_stack_init();
#if MESH_FEATURE_GATT_ENABLED
    gap_params_init();
    conn_params_init();
#endif
    board_init();
    mesh_init();
    m_my_ui_init();

    
