riversnails/ble_mesh-thingy52/nrf5_SDK_for_Mesh_v3.2.0_src/examples/thingy52-mesh-provisioning-demo-master/thingy_provisioning_demo/src/main.c
}

static void start(void)
{
    rtt_input_enable(app_rtt_input_handler, RTT_INPUT_POLL_PERIOD_MS);
    //nrf_gpio_cfg_input(THINGY_BUTTON,GPIO_PIN_CNF_PULL_Pullup);
    if (!m_device_provisioned)
    {
        static const uint8_t static_auth_data[NRF_MESH_KEY_SIZE] = STATIC_AUTH_DATA;
        mesh_provisionee_start_params_t prov_start_params =
        {
            .p_static_data    = static_auth_data,
            .prov_complete_cb = provisioning_complete_cb,
            .prov_device_identification_start_cb = device_identification_start_cb,
            .prov_device_identification_stop_cb = NULL,
            .auth_output_cb = NULL,//provisioning_blink_output_cb,  // 이 인자에 값이 있으면         obb가 설정되게 된다
            .prov_abort_cb = provisioning_aborted_cb,
            .p_device_uri = EX_URI_LS_SERVER
        };
        ERROR_CHECK(mesh_provisionee_prov_start(&prov_start_params));
        if(!USB_connected) 
        {
            led_breath_red();
        }

    }
    else
    {  
        //erase bond information if button pressed when reset
        if (nrf_gpio_pin_read(THINGY_BUTTON)==0)
        {
 
#if MESH_FEATURE_GATT_PROXY_ENABLED
            (void) proxy_stop();
#endif
            mesh_stack_config_clear();
            nrf_delay_ms(500);
            node_reset();
        }
   
        
     if(!USB_connected)
     {
     
        hal_led_blink_ms(100,2);
     }
        
    }
   
    mesh_app_uuid_print(nrf_mesh_configure_device_uuid_get());

    ERROR_CHECK(mesh_stack_start());

   /* hal_led_pin_set(0);
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_START);*/
}

static void drv_humidity_evt_handler(drv_humidity_evt_t event)
{
}

static void drv_pressure_evt_handler(drv_pressure_evt_t const * p_event)
{
}

static void init_sensor()
{
    uint32_t err_code;

    static const nrf_drv_twi_config_t twi_config =
    {
            .scl                = TWI_SCL,
            .sda                = TWI_SDA,
            .frequency          = NRF_TWI_FREQ_400K,
            .interrupt_priority = APP_IRQ_PRIORITY_LOW
    };

    static const drv_hts221_twi_cfg_t test_humi = 
    {
            .twi_addr = HTS221_ADDR,
            .pin_int = HTS_INT,
            .p_twi_instance = &m_twi_sensors,
            .p_twi_config = &twi_config
    };

    static const drv_hts221_cfg_t cfg = {
            .av_conf   = AV_CONF_REG_DEFAULT,
            .ctrl_reg1 = (CTRL_REG1_DEFAULT | (CTRL_REG1_PD_Active << CTRL_REG1_PD_Pos)),
            .ctrl_reg2 =  CTRL_REG2_DEFAULT,
            .ctrl_reg3 = (CTRL_REG3_DEFAULT | (CTRL_REG3_DRDY_Enable << CTRL_REG3_DRDY_Pos) | (CTRL_REG3_DRDY_H_L_ActiveLow << CTRL_REG3_DRDY_H_L_Pos) )
    };
          
    static drv_humidity_init_t    h_init_params =
    {
        .twi_addr            = HTS221_ADDR,
        .pin_int             = HTS_INT,
        .p_twi_instance      = &m_twi_sensors,
        .p_twi_cfg           = &twi_config,
        .evt_handler         = drv_humidity_evt_handler
    };
    
    static drv_pressure_init_t p_init_params =
    {
        .twi_addr            = LPS22HB_ADDR,
        .pin_int             = LPS_INT,
        .p_twi_instance      = &m_twi_sensors,
        .p_twi_cfg           = &twi_config,
        .evt_handler         = drv_pressure_evt_handler,
        .mode                = DRV_PRESSURE_MODE_BAROMETER
    };

    err_code = drv_humidity_init(&h_init_params);
    if(err_code != NRF_SUCCESS) while(1);

    err_code = drv_hts221_open(&test_humi);
    if(err_code != NRF_SUCCESS) while(1);
    err_code = drv_hts221_cfg_set(&cfg);
    if(err_code != NRF_SUCCESS) while(1);
    err_code = drv_hts221_close();
    if(err_code != NRF_SUCCESS) while(1);

    err_code = drv_pressure_init(&p_init_params);
    if(err_code != NRF_SUCCESS) while(1);
}

static bool sensor_start = false;
static bool init_toggle = true;

int main(void)
{
    initialize();
    start();
    
    ble_gap_addr_t ble_addr;
    sd_ble_gap_addr_get(&ble_addr);

    add_addr_node(ble_addr.addr);
    
    set_available(true, 0);
    print_addr(ble_addr.addr);

    init_device_manager(&t_conv_data, &h_conv_data, &sensor_start);
    init_send_manager(&mesh_send_manager);

    
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "init end!\n");
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "%d\n", CUSTOM_SET_MAXLEN);


    unsigned long p_millis = 0;
    unsigned long test_p_millis = 0;
    uint8_t state = 0;

    bool toggle = false;

    for (;;)
    {
        (void)sd_app_evt_wait();
        
        #if IS_CLIENT
        if(sensor_start)
        {
            if(init_toggle)
            {
                init_toggle = false;
                init_sensor();
            }
        }
        
        if(get_millis() - p_millis >= 200 && sensor_start)
        {
          p_millis = get_millis();

          drv_humidity_sample();
          drv_pressure_sample();

          temperature_conv_data(drv_humidity_temp_get(), &t_conv_data);
          humidity_conv_data(drv_humidity_get(), &h_conv_data);
          pressure_conv_data(drv_pressure_get(), &p_conv_data);
          //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "t_data = %2d.%-2d h_data = %2d p_data = %4d.%-2d\n", t_conv_data.integer, t_conv_data.decimal, h_conv_data, p_conv_data.integer, p_conv_data.decimal);
        }
        #else
        //if(millis - p_millis >= 1000)
        //{
        //  p_millis = millis;
        //  if(toggle == false) toggle = true;
        //  else toggle = false;
        //}

        //if(toggle)
        //{
        //  send_data_requset();
        //}
        #endif
        if(test_toggle == true)
        {
            if(get_millis() - test_p_millis >= 100)
            {
                test_p_millis = get_millis();
                //get_data_all();
            }
        }
        else
        {
            test_p_millis = get_millis();
        }
    }
}
